import the required libraries

In [ ]:
import pandas as pd
import numpy as np

Pandas has two objects, namely series and dataframes

# Object Series
Object Series has one data dimension. It does not have a column name because it only has one column and has an index.

In [2]:
data = [0.25,0.5,0.75,1]

## change the data into series

In [3]:
data = pd.Series(data)
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

## convert from series to array

In [4]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

# Display Index
The index is a range, where the starting point is inclusive of the range and the stop point is exclusive of the range

In [11]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
list(range(1,10))

[1, 2, 3, 4, 5, 6, 7, 8, 9]

# How to call data

In [12]:
data[2]

0.75

* Implicit index is the default index of python starting from 0.
* We can define the index, this is called the explicit index. The explicit index is the defined index
* When defining the index, the number of indexes must be equal to the number of data

In [13]:
data = pd.Series([0.25,0.5,0.75,1],index =['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [14]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [15]:
data.index

Index(['a', 'b', 'c', 'd'], dtype='object')

Call the data

In [27]:
#index ekplisit
data = pd.Series([0.25,0.5,0.75,1],index =['a','b','c','d'])
data['a']

0.25

* This is data selection
* even though we have created an explicit index, we can still call the implicit index

In [29]:
#index ekplisit
data = pd.Series([0.25,0.5,0.75,1],index =['a','b','c','d'])
data[3]

1.0

When the implicit index and the explicit index are the same. When we call the data, it will only rely on the explicit index.

In [32]:
data_2 = pd.Series([0.25,0.5,0.75,1],index=[2,5,3,7])
data_2[2]

0.25

In [37]:
data_2 = pd.Series([0.25,0.5,0.75,1],index=[10,11,6,7])
data_2[0]

KeyError: 0

In [34]:
# We will try to do data slicing
data = pd.Series([0.25,0.5,0.75,1],index=['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

For example, we will call data from b to data c

In [38]:
data['b':'c'] #Explicit Index will output 2, while using implicit will bring up 1 output

b    0.50
c    0.75
dtype: float64

However, if we slicing the implicit index, only the starting point will appear because the implicit index is a range

In [39]:
data[1:2] #Index Implisit

b    0.5
dtype: float64

# loc and iloc
loc is location and iloc is index location

Example of data that has the same implicit index and explicit index.

In [3]:
import numpy as np
import pandas as pd

data_2 = pd.Series([0.25,0.5,0.75,1],index=[2,5,3,7])

data_2

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

When we access an index, what appears is the explicit index...

In [6]:
data_2[2] # Index eksplisit : Slicing

0.25

When we call the explicit index from index 2 to index 3. The value that will appear from the implicit index.

In [7]:
data_2[2:3] # Index implisit : Slicing

3    0.75
dtype: float64

When the explicit index and the implicit index are the same, there will be inconsistencies as in the case above.

## To overcome this inconsistency, we will use the loc and iloc rules.
* Loc is to call its explicit index
* Iloc is to call its implicit index.

In [9]:
import numpy as np
import pandas as pd

data_2 = pd.Series([0.25,0.5,0.75,1],index=[2,5,3,7])

data_2

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [10]:
#Loc

data_2.loc[3] #selecting index ekplisit

0.75

In [11]:
data_2.loc[2:3] #slicing index ekplisit

2    0.25
5    0.50
3    0.75
dtype: float64

In [12]:
#Iloc

data_2.iloc[3] #selecting index implisit

1.0

In [13]:
data_2.iloc[2:3] #slicing index implisit

3    0.75
dtype: float64

In [1]:
dict_population = {'Jakarta':750,
                'Bogor': 490,
                'Depok':350,
                'Tangerang':270,
                'Bekasi':670}
# This is just an example, not a real population figure

In [2]:
dict_population

{'Jakarta': 750, 'Bogor': 490, 'Depok': 350, 'Tangerang': 270, 'Bekasi': 670}

In [3]:
#transform dictionary to series
import numpy as np
import pandas as pd

population = pd.Series(dict_population)
population

Jakarta      750
Bogor        490
Depok        350
Tangerang    270
Bekasi       670
dtype: int64

In [46]:
population.loc['Depok']

350

In [50]:
population.iloc[2]

350

In [7]:
dict_area = {'Jakarta':737,
            'Bogor':325,
            'Depok': 247,
            'Tangerang':302,
            'Bekasi':355}

In [8]:
dict_area

{'Jakarta': 737, 'Bogor': 325, 'Depok': 247, 'Tangerang': 302, 'Bekasi': 355}

In [9]:
import numpy as np
import pandas as pd

area = pd.Series(dict_area)
area

Jakarta      737
Bogor        325
Depok        247
Tangerang    302
Bekasi       355
dtype: int64

# Data Frame
Data Frame is a collection of series, with at least one series.

In [1]:
import numpy as np
import pandas as pd
# This is just an example, not a real population figure

dict_population = {'Jakarta':750,
                 'Bogor': 490,
                 'Depok':350,
                 'Tangerang':270,
                 'Bekasi':670}

dict_area = {'Jakarta':737,
             'Bogor':325,
             'Depok': 247,
             'Tangerang':302,
             'Bekasi':355}

In [10]:
population = pd.Series(dict_population)
population

Jakarta      750
Bogor        490
Depok        350
Tangerang    270
Bekasi       670
dtype: int64

In [11]:
area = pd.Series(dict_area)
area

Jakarta      737
Bogor        325
Depok        247
Tangerang    302
Bekasi       355
dtype: int64

In [12]:
area = pd.DataFrame({'Region Population':population,"Area":area})

In [13]:
area

           Region Population  Area
Jakarta                  750   737
Bogor                    490   325
Depok                    350   247
Tangerang                270   302
Bekasi                   670   355

In [14]:
area['Area']

Jakarta      737
Bogor        325
Depok        247
Tangerang    302
Bekasi       355
Name: Area, dtype: int64

In [15]:
area['Area']['Jakarta']

737

When calling data with the regional.pop syntax, it will appear as below because pop is the same as the name of the function in the data frame

In [16]:
area.pop

<bound method DataFrame.pop of            Region Population  Area
Jakarta                  750   737
Bogor                    490   325
Depok                    350   247
Tangerang                270   302
Bekasi                   670   355>

In [19]:
area.loc ["Depok":"Tangerang"] #Search data using explicit index

           Region Population  Area
Depok                    350   247
Tangerang                270   302

In [20]:
area.iloc [2:4] #Searching data using implicit index

           Region Population  Area
Depok                    350   247
Tangerang                270   302

# Trying to use Data Titanic.csv

In [21]:
#We load titanic data
import pandas as pd
import numpy as np

df = pd.read_csv('Titanic.csv')

In [22]:
#View data from top data
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [23]:
#See data from the top data with a limit of 10
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [24]:
#View data info
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [25]:
#See non-null count of data
df.notnull().sum()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [26]:
#Seeing the number of nulls from the data
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [27]:
#View the number of data

df.sum()

C:\Users\HP\AppData\Local\Temp\ipykernel_12932\923610039.py:3: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.sum()

PassengerId                                               397386
Survived                                                     342
Pclass                                                      2057
Name           Braund, Mr. Owen HarrisCumings, Mrs. John Brad...
Sex            malefemalefemalefemalemalemalemalemalefemalefe...
Age                                                     21205.17
SibSp                                                        466
Parch                                                        340
Ticket         A/5 21171PC 17599STON/O2. 31012821138033734503...
Fare                                                  28693.9493
dtype: object

In [28]:
#View data from below

df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [29]:
# View the number of rows and columns

df.shape

(891, 12)

In [30]:
# View column

df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [31]:
# View index

df.index

RangeIndex(start=0, stop=891, step=1)

In [32]:
# Displays information from columns in the form of numbers 
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [33]:
# For example displaying the average of column Age
df['Age'].mean()

29.69911764705882

In [36]:
# For example displaying the median of column Age
of['Age'].median()

28.0

In [37]:
# For example displaying mode from column Age
df['Age'].mode()[0]

24.0

In [38]:
# View the mean of the data
df.mean()

C:\Users\HP\AppData\Local\Temp\ipykernel_15052\1907348947.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [39]:
# For example see the mean of column Age
df.age.mean()

29.69911764705882

In [40]:
# For example view NaN from column Age
df.age.isnull()

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888     True
889    False
890    False
Name: Age, Length: 891, dtype: bool

In [42]:
# Then we mask
df[df.Age.isnull()] # For example see all data whose Age is NaN from the Age column

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,2631,7.2250,NaN,C
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,330959,7.8792,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [43]:
# For example see unique data from column Sex
df.Sex.unique()

array(['male', 'female'], dtype=object)

In [44]:
# For example see the number of unique from Column Sex
df.Sex.nunique()

2

In [47]:
# For example the proportion of column sex
df.Sex.value_counts()

male      577
female    314
Name: Sex, dtype: int64

# Task 1

In [7]:
import pandas as pd
import numpy as np

my = [["Valent Aderiandra",20,"https://www.linkedin.com/in/valentaderiandra/"],["Data","Scientist",2022]]
my = pd.Series(my)
my

0    [Valent Aderiandra, 20, https://www.linkedin.c...
1                              [Data, Scientist, 2022]
dtype: object

In [8]:
my.values

array([list(['Valent Aderiandra', 20, 'https://www.linkedin.com/in/valentaderiandra/']),
       list(['Data', 'Scientist', 2022])], dtype=object)

# Task 2

In [19]:
import pandas as pd
import numpy as np
number = [[[1,2],[3,4]],
    [[5,6],[7,8]],
    [[5,6],[7,8]],[[9,10],[11,12]]]

number = pd.Series (number)
number

0    [[1, 2], [3, 4], [5, 6], [7, 8]]
1                    [[5, 6], [7, 8]]
2                 [[9, 10], [11, 12]]
dtype: object

In [21]:
number.values

array([list([[1, 2], [3, 4], [5, 6], [7, 8]]), list([[5, 6], [7, 8]]),
       list([[9, 10], [11, 12]])], dtype=object)

In [24]:
import pandas as pd
import numpy as np

number = pd.Series([[[1,2],[3,4],[5,6],[7,8]],[[5,6],[7,8]],[[9,10],[11,12]]],index =['a','b','c'])
number

a    [[1, 2], [3, 4], [5, 6], [7, 8]]
b                    [[5, 6], [7, 8]]
c                 [[9, 10], [11, 12]]
dtype: object

# Task 3

In [59]:
import pandas as pd
import numpy as np 

mybiodata = pd.Series(["Valent Aderiandra","Data Science",20," https://www.linkedin.com/in/valentaderiandra/"],index = [2,4,1,3])
mybiodata

2                                 Valent Aderiandra
4                                      Data Science
1                                                20
3     https://www.linkedin.com/in/valentaderiandra/
dtype: object

## Loc

In [56]:
print(mybiodata.loc[3])

https://www.linkedin.com/in/valentaderiandra/

In [57]:
mybiodata.loc[2:3]

2                                Valent Aderiandra
4                                     Data Science
1                                               20
3    https://www.linkedin.com/in/valentaderiandra/
dtype: object

In [32]:
mybiodata.loc[2::2]

2    Valent Aderiandra
1                   20
dtype: object

## Iloc

In [30]:
print(mybiodata.iloc[3])

https://www.linkedin.com/in/valentaderiandra/

In [33]:
mybiodata.iloc[2:3]

1    20
dtype: object

# Task 4

In [42]:
#Membuat dictionary
import numpy as np
import pandas as pd

dict_city = {'Valent Aderiandra':"Surabaya",
            'Rafael': "Bandung",
             'Marsha':"Jakarta"}
dict_country = {'Valent Aderiandra':"Indonesia",
                'Rafael': "Indonesia",
                 'Marsha':"Indonesia"}
dict_hobby = {'Valent Aderiandra':"Nightride",
                'Rafael': "Nightride",
                 'Marsha':""}

In [43]:
#Membuat Data Series
city=pd.Series(dict_city)
country=pd.Series(dict_country)
hobby=pd.Series(dict_hobby)

In [44]:
city

Valent Aderiandra    Surabaya
Rafael                Bandung
Marsha                Jakarta
dtype: object

In [45]:
country

Valent Aderiandra    Indonesia
Rafael               Indonesia
Marsha               Indonesia
dtype: object

In [46]:
hobby

Valent Aderiandra    Nightride
Rafael               Nightride
Marsha
dtype: object

In [47]:
myfriend = pd.DataFrame({"City":city,"Country":country,"Hobby":hobby})
myfriend

                       City    Country      Hobby
Valent Aderiandra  Surabaya  Indonesia  Nightride
Rafael              Bandung  Indonesia  Nightride
Marsha              Jakarta  Indonesia

In [49]:
myfriend.loc["Valent Aderiandra"]

City        Surabaya
Country    Indonesia
Hobby      Nightride
Name: Valent Aderiandra, dtype: object

In [50]:
myfriend.loc["Valent Aderiandra":"Rafael"] #Mencari menggunakan index ekplisit

                       City    Country      Hobby
Valent Aderiandra  Surabaya  Indonesia  Nightride
Rafael              Bandung  Indonesia  Nightride

In [51]:
myfriend.iloc[0::2] #Mencari menggunakan index implisit

                       City    Country      Hobby
Valent Aderiandra  Surabaya  Indonesia  Nightride
Marsha              Jakarta  Indonesia

# Task 5

In [34]:
df = pd.read_csv("group1.csv")

In [35]:
df.head()

                     Name  Domicile      Hobby Aspirations  pet  age
0     Agung Wahyu Prayogo       NaN    Podcast    Minister  2.0   21
1         Putri Windasari  Semarang        NaN  Ambassador  2.0   21
2  Fauziya Alya Ramadhana  Surabaya  Streaming         NaN  4.0   21
3       Valent Aderiandra  Surabaya   Teaching    Governor  NaN   20
4  Reno Darin Khalifah. P  Surabaya       Sing      Singer  1.0   21

# Task 6

In [36]:
import numpy as np
import pandas as pd

group1 = pd.read_csv("group1.csv")

In [37]:
group1.head()

                     Name  Domicile      Hobby Aspirations  pet  age
0     Agung Wahyu Prayogo       NaN    Podcast    Minister  2.0   21
1         Putri Windasari  Semarang        NaN  Ambassador  2.0   21
2  Fauziya Alya Ramadhana  Surabaya  Streaming         NaN  4.0   21
3       Valent Aderiandra  Surabaya   Teaching    Governor  NaN   20
4  Reno Darin Khalifah. P  Surabaya       Sing      Singer  1.0   21

In [38]:
group1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         5 non-null      object
 1   Domicile     4 non-null      object
 2   Hobby        4 non-null      object
 3   Aspirations  4 non-null      object
 4   pet          4 non-null      float64
 5   age          5 non-null      int64
dtypes: float64(1), int64(1), object(4)
memory usage: 368.0+ bytes

In [39]:
group1.isnull().sum()

Name           0
Domicile       1
Hobby          1
Aspirations    1
pet            1
age            0
dtype: int64

In [40]:
group1.notnull().sum()

Name           5
Domicile       4
Hobby          4
Aspirations    4
pet            4
age            5
dtype: int64

In [41]:
group1.sum()

C:\Users\HP\AppData\Local\Temp\ipykernel_12932\2066623512.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  group1.sum()

Name    Agung Wahyu PrayogoPutri WindasariFauziya Alya...
pet                                                   9.0
age                                                   104
dtype: object

In [42]:
group1.shape

(5, 6)

In [43]:
group1.columns

Index(['Name', 'Domicile', 'Hobby', 'Aspirations', 'pet', 'age'], dtype='object')

In [44]:
group1.tail()

                     Name  Domicile      Hobby Aspirations  pet  age
0     Agung Wahyu Prayogo       NaN    Podcast    Minister  2.0   21
1         Putri Windasari  Semarang        NaN  Ambassador  2.0   21
2  Fauziya Alya Ramadhana  Surabaya  Streaming         NaN  4.0   21
3       Valent Aderiandra  Surabaya   Teaching    Governor  NaN   20
4  Reno Darin Khalifah. P  Surabaya       Sing      Singer  1.0   21

In [32]:
group1.index

RangeIndex(start=0, stop=5, step=1)

# Task 7

In [45]:
import numpy as np
import pandas as pd

group1 = pd.read_csv("group1.csv")
group1

                     Name  Domicile      Hobby Aspirations  pet  age
0     Agung Wahyu Prayogo       NaN    Podcast    Minister  2.0   21
1         Putri Windasari  Semarang        NaN  Ambassador  2.0   21
2  Fauziya Alya Ramadhana  Surabaya  Streaming         NaN  4.0   21
3       Valent Aderiandra  Surabaya   Teaching    Governor  NaN   20
4  Reno Darin Khalifah. P  Surabaya       Sing      Singer  1.0   21

In [46]:
group1.describe()

            pet        age
count  4.000000   5.000000
mean   2.250000  20.800000
std    1.258306   0.447214
min    1.000000  20.000000
25%    1.750000  21.000000
50%    2.000000  21.000000
75%    2.500000  21.000000
max    4.000000  21.000000

In [47]:
group1.Domicile.value_counts()

Surabaya    3
Semarang    1
Name: Domicile, dtype: int64

In [48]:
group1.Domicile.nunique()

2

In [50]:
group1['Aspirations']

0      Minister
1    Ambassador
2           NaN
3      Governor
4        Singer
Name: Aspirations, dtype: object

In [51]:
group1.age.mean()

20.8